[
  {
    "title": "Portfolio_web_App",
    "avatar": "/static/images/avatar/1.jpg",
    "avatarColor": "red",
    "description": "Многопользовательское, микросервисное приложение для работы с портфолио.",
    "technologies": ".Net, API, Clan Architecture, Docker,  MongoBD, PostgreSQL, CICD.",
    "link": "https://github.com/ShadowGreg/react_portfolio",
    "linkText": "_переход на GitLab",
    "additionalInfo": "Этот проект навеян историей индусских программистов которые делают свои визитные карточки в интернете, мне интересно по экспериментировать и соединить Telegram как простой интерфейс для управления контентом портфолио"
  },
  {
    "title": "Genealogical_Portal",
    "avatar": "/static/images/avatar/1.jpg",
    "avatarColor": "green",
    "description": "Многопользовательское, микросервисное приложение для формирования генеалогической карточки.",
    "technologies": ".Net, API, SMTP, RabbitMQ, Clan Architecture, Docker,  MongoBD, PostgreSQL, CICD.",
    "link": "https://gitlab.com/NullReferenceException_dev/genealogical_portal",
    "linkText": "_переход на GitLab",
    "additionalInfo": "В этом проекте я разрабатываю Notification Servise предназначенный для получения сообщений из RabbitMq и рассылки сообщений через SMTP почту с использованием MailKit"
  },
  {
    "title": "ElectricalEngineeringLite",
    "avatar": "/static/images/avatar/1.jpg",
    "avatarColor": "blue",
    "description": "Desktop приложение для инженерных расчётов и построение чертежей в AUTOCad.",
    "technologies": ".Net Framework, DXF API, WPF, MVVM.",
    "link": "https://github.com/ShadowGreg/ElectricalEngineeringLite",
    "linkText": "_переход на GitHub",
    "additionalInfo": "Задача проекта заключалась в разработке программного обеспечения с улучшенными параметрами автоматического проектирования, а также в исследовании существующих систем автоматического проектирования BIM и изучении возможностей улучшения и внедрения систем искусственного интеллекта для BIM-проектирования в целом."
  },
  {
    "title": "GOF_DesignPatterns",
    "avatar": "/static/images/avatar/1.jpg",
    "avatarColor": "red",
    "description": "Приложения на безе .NET",
    "technologies": ".Net, Clean Architecture, GOF DesignPatterns, EF fnd many more...",
    "link": "https://github.com/ShadowGreg/GangOfFour_GOF_DesignPatterns_SelfTask",
    "linkText": "_переход на GitHab",
    "additionalInfo": "Задача в проекте заключается в том, чтобы отработать и закрепить навыки в архитектурных паттернах и примерных паттернах проектирования. Архитектурные паттерны и паттерны проектирования являются важными инструментами для создания гибких, масштабируемых и поддерживаемых приложений.\nАрхитектурные паттерны определяют общую структуру и организацию приложения, в то время как паттерны проектирования предоставляют решения для конкретных проблем проектирования.\nНекоторые из популярных архитектурных паттернов включают в себя:\nModel-View-Controller (MVC): Разделяет приложение на три компонента - модель, представление и контроллер, чтобы обеспечить разделение ответственности и улучшить модульность.\nMicroservices: Разделяет приложение на небольшие, независимые сервисы, которые могут разрабатываться и масштабироваться независимо друг от друга.\nEvent-Driven Architecture (EDA): Основан на обмене сообщениями и событиях между компонентами приложения, что позволяет создавать более гибкие и отзывчивые системы.\nНекоторые из популярных паттернов проектирования включают в себя:\nSingleton: Гарантирует, что класс имеет только один экземпляр и предоставляет глобальную точку доступа к этому экземпляру.\nFactory: Предоставляет общий интерфейс для создания объектов, но позволяет подклассам решать, какой класс создавать.\nObserver: Определяет зависимость \"один-ко-многим\" между объектами, чтобы при изменении состояния одного объекта все зависимые объекты были уведомлены и обновлены."
  },
  {
    "title": "ChatBotTelegram2PDF",
    "avatar": "/static/images/avatar/1.jpg",
    "avatarColor": "green",
    "description": "Telegram bot для формирования PDF-файлов из любых типов файлов.",
    "technologies": "Python, Docker, Telegram Bot API, PDF API, Images.",
    "link": "https://github.com/ShadowGreg/ChatBotTelegram2PDF",
    "linkText": "_переход на GitHub",
    "additionalInfo": " Этот проект создан для того, чтобы сократить время и простой ресурс для создания PDF-файлов."
  }

]